<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css">
  <link href="https://cdn.bootcss.com/flag-icon-css/2.8.0/css/flag-icon.css" rel="stylesheet"/>
  <title>Repositorio de aplicaciones para android</title>
  <link rel="stylesheet" href="../style_store.css">
</head>
<body>

  <section class="menu" style="border-radius: 15px">
    <nav>
      <ul>
        <li><a href="index.html">Inicio</a></li>
        <li><a href="#">Repositorio de aplicaciones para android</a></li>
        <li><a href="../en/android_store.html"><i class="flag-icon flag-icon-gb"> </i></a></li>
      </ul>
    </nav>
  </section>
  <section class="box" style="border-radius: 15px">
    <br/>
    <img src="../assets/house.jpeg" width="180" alt="" class="box-img">
    <h1>La casita para las apps de android</h1>
    <p>Aplicaciones que sub&iacute; a la pagina:</p>
    <ul>
      <li><a href="maximun.html"><i class="fa fa-android" aria-hidden="true">&#160;Maximun</i></a></li>
    </ul>
  </section>
  <section class="box" style="border-radius: 15px">
    <h1>&iquest;Porqu&eacute; el logo de la casita se ve horrible?</h1>
    <br/>
    <h2>Portabilidad para personas no t&eacute;cnicas:</h2>
    <p>Del lat&iacute;n port&amacr;re significa transportar,
       &#160;personalmente la palabra del lat&iacute;n <b>optio</b> la veo m&iacute;s
      &#160;adecuada dado que significa "libertad de escoger".</p><br/>
      <p>Portar es adaptar algo que esta en un contexto a otro contexto
        &#160;sin cambiar o alterar su funci&oacute;n.
        &#160;Un programa se considera portable si el costo de tiempo de
        &#160;adaptarlo a otra plataforma es menor que hacer ese algo desde cero.
      </p><br/>
      <p>La necesidad de portar viene porque el otro ya elig&iacute;o un contexto
        &#160;diferente al m&iacute;o. En consecuencia, respetando su libertad porto.
      </p><br/>
      <h2>El ant&oacute;nimo de la portabilidad:</h2>
      <p>La historia de Android comenz&oacute; en octubre de 2003,
         &#160;varios años antes de que Apple anunciara su primer iPhone e iOS.
         &#160;En 2005, Google adquiri&oacute; Android.
         &#160;Para ser portables se empleo un sistema operativo libre (Linux).
         &#160;Eso significaba que el sistema operativo podr&iacute;a ofrecerse a
         &#160;terceros fabricantes de tel&eacute;fonos m&oacute;viles de forma gratuita.
      </p><br/>
      <p>De esta forma llegamos a tener un cuasi-&uacute;nico producto gratuito,
        &#160;hablo del sistema operativo Android, el cual
        &#160;es "vendido", mantenido y modificado por google.
        &#160;Los consumidores, o sea terceros fabricantes de tel&eacute;fonos m&oacute;viles
        &#160;encuentran un único producto que además es ofrecido por sólo un vendedor.
        &#160;De esta forma, no tienen otras alternativas entre las que elegir.
        &#160;Los consumidores, o sea usuarios de Android
        &#160;solo conocen un único lugar llamado playstore,
        &#160;que además es ofrecido por sólo un proveedor llamado goole.
      </p><br/>
      <h2>La oferta en tiempos de monopolio:</h2>
      <p>El sistema operativo de Apple, iOS es un sustituto a Android, pero el costo
        &#160;de un iphone es superior. Adem&aacute;s iOS no estar&iacute;a
        &#160;disponible para el resto de fabricantes de tel&eacute;fonos.
        &#160;Por otro lado, los usuarios de los tel&eacute;fonos m&oacute;viles no saben o no pueden
        &#160;elegir un sustito de Android gratuito y de calidad.
      </p><br/>
      <p>Desarrollar un sistema operativo para un dispositivo no es sencillo.
        &#160;A muy pocos desarrolladores les gusta trabajar a bajo nivel y gratis.
        &#160;Gran impedimento.
      </p><br/>
      <h2>La libertad en tiempos de monopolio:</h2>
      <p>Si solo podemos elegir a Android o iOS ambos proveedores influyen sobre nosotros.
        &#160;Nos ponen actualizaciones automaticas, dicha configuraci&oacute;n es
        &#160;modificable pero esta por defecto. Tras varias actualizaciones
        &#160;quedan dos alternativas:cambiar de celular todos los a&ntilde;os
        &#160;o llevar el celu al t&eacute;cnico para formatearlo.
        &#160;Cambia sus politicas en funci&oacute; de sus intereses.
        &#160;Ni Tolkien imagino a alguien con la capacidad de proveer su producto gratis y
        &#160;vender en masa su influencia.
      </p><br/>
  </section>
  <section class="box" style="border-radius: 15px">
    <h1>&iquest;D&oacute;nde viven las apps?</h1>
    <br/>
    <h2>&iquest;Qu&eacute; es una app?</h2>
    <p>Una app para celular es un archivo.
      &#160;En el caso de android es una carpeta comprimida en formato zip,
      &#160;Contiene toda la informaci&oacute;n necesaria para instalar,
      &#160;todos las imagenes a mostrar y
      &#160;el c&oacute;digo a ejecutar</p>
      <br/>
      <p>En el caso de android si el archivo contiene la extenci&oacute;n <b>apk</b>
      &#160;contiene la informaci&oacute;n necesaria para funcionar en diferentes
      &#160;celulares.<br/>
      En cambio, si el archivo contiene la extenci&oacute;n <b>aab</b>
      &#160;esta pensado para ser generador de apks m&aacute;s peque&ntilde;os y
    &#160;de esta forma ser distribu&iacute;do.</p><br/>
  </section>
  <section class="box" style="border-radius: 15px; margin-bottom: 7%;">
    <p>Puede contactarme por:</p>
    <ul>
      <li><a href="https://twitter.com/pelo_de_mono_2"><i class="fa fa-twitter-square" aria-hidden="true"></i></a></li>
      <li><a href="https://github.com/fllaryora"><i class="fa fa-github-square" aria-hidden="true"></i></i></a></li>
      <li><a href="https://www.linkedin.com/in/francisco-llaryora-27b74268/"><i class="fa fa-linkedin-square" aria-hidden="true"></i></a></li>
    </ul>
  </section>
</body>
</html>
